preconcentrationCE/Sample_stacking/12_5sample_stacking/0/Cz
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
5000
(
1.57628768e-05
4.73075379e-05
7.88900365e-05
0.000110510418
0.000142168728
0.000173865012
0.000205599315
0.000237371683
...
)
;

boundaryField
{
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    wall
    {
        type            calculated;
        value           nonuniform List<scalar> 
5000
(
1.57628768e-05
4.73075379e-05
7.88900365e-05
0.000110510418
0.000142168728
0.000173865012
0.000205599315
0.000237371683
...
)
;
    }
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 1;
    }
    axis
    {
        type            empty;
    }
}


// ************************************************************************* //
